Repository: JiahaoAlbus/YNX-Chain
Catalog: apps/calendar/native/ios/YNXCalendar/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, ja, ko, pt, ru, zh_hans, zh_hant

# sign_in
source: Sign in with YNX Wallet
ar: تسجيل الدخول باستخدام YNX Wallet
de: Mit YNX Wallet anmelden
es: Iniciar sesión con YNX Wallet
fr: Se connecter avec YNX Wallet
id: Masuk dengan YNX Wallet
ja: YNX Walletでサインイン
ko: YNX Wallet으로 로그인
pt: Entrar com YNX Wallet
ru: Войти через YNX Wallet
zh_hans: 登录 YNX 钱包
zh_hant: 登入 YNX Wallet

source: Today
ar: اليوم
de: Heute
es: Hoy
fr: Aujourd’hui
id: Hari ini
ja: 今日
ko: 오늘
pt: Hoje
ru: Сегодня
zh_hans: 今天
zh_hant: 今天

# create
source: Create event
ar: إنشاء حدث
de: Termin erstellen
es: Crear evento
fr: Créer un événement
id: Buat acara
ja: 予定を作成
ko: 일정 만들기
pt: Criar evento
ru: Создать событие
zh_hans: 创建日程
zh_hant: 建立活動

# empty
source: No events in this range
ar: لا توجد أحداث في هذا النطاق
de: Keine Termine in diesem Zeitraum
es: No hay eventos en este intervalo
fr: Aucun événement dans cette période
id: Tidak ada acara dalam rentang ini
ja: この期間に予定はありません
ko: 이 범위에 일정이 없습니다
pt: Nenhum evento neste intervalo
ru: В этом диапазоне событий нет
zh_hans: 此范围暂无日程
zh_hant: 此範圍沒有活動

# offline
source: Offline — changes are queued on this device
ar: غير متصل — التغييرات في قائمة الانتظار على هذا الجهاز
de: Offline — Änderungen warten auf diesem Gerät
es: Sin conexión: los cambios quedan en cola en este dispositivo
fr: Hors ligne — les modifications sont en attente sur cet appareil
id: Offline — perubahan mengantre di perangkat ini
ja: オフライン — 変更はこの端末で待機します
ko: 오프라인 — 변경 사항이 이 기기에서 대기합니다
pt: Offline — as alterações ficam na fila deste dispositivo
ru: Нет сети — изменения в очереди на устройстве
zh_hans: 离线——更改已在此设备排队
zh_hant: 離線——變更已在此裝置排隊

# invite
source: Invite contacts by handle
ar: دعوة جهات الاتصال بالمعرّف
de: Kontakte per Kennung einladen
es: Invitar contactos por identificador
fr: Inviter des contacts par identifiant
id: Undang kontak dengan nama pengguna
ja: ハンドル名で連絡先を招待
ko: 핸들로 연락처 초대
pt: Convidar contatos pelo identificador
ru: Пригласить контакты по имени
zh_hans: 用联系人名邀请
zh_hant: 以聯絡人名稱邀請

source: Time zone
ar: المنطقة الزمنية
de: Zeitzone
es: Zona horaria
fr: Fuseau horaire
id: Zona waktu
ja: タイムゾーン
ko: 시간대
pt: Fuso horário
ru: Часовой пояс
zh_hans: 时区
zh_hant: 時區

# repeat
source: Recurrence
ar: التكرار
de: Wiederholung
es: Repetición
fr: Récurrence
id: Pengulangan
ja: 繰り返し
ko: 반복
pt: Recorrência
ru: Повторение
zh_hans: 重复
zh_hant: 重複

source: Reminder
ar: تذكير
de: Erinnerung
es: Recordatorio
fr: Rappel
id: Pengingat
ja: リマインダー
ko: 알림
pt: Lembrete
ru: Напоминание
zh_hans: 提醒
zh_hant: 提醒

# conflict
source: Conflict check
ar: فحص التعارضات
de: Konflikte prüfen
es: Comprobar conflictos
fr: Vérifier les conflits
id: Periksa konflik
ja: 競合を確認
ko: 충돌 확인
pt: Verificar conflitos
ru: Проверка конфликтов
zh_hans: 冲突检查
zh_hant: 衝突檢查

# review
source: Review changes
ar: مراجعة التغييرات
de: Änderungen prüfen
es: Revisar cambios
fr: Vérifier les modifications
id: Tinjau perubahan
ja: 変更を確認
ko: 변경 사항 검토
pt: Revisar alterações
ru: Проверить изменения
zh_hans: 检查更改
zh_hant: 檢查變更

# approve
source: Approve change
ar: الموافقة على التغيير
de: Änderung freigeben
es: Aprobar cambio
fr: Approuver la modification
id: Setujui perubahan
ja: 変更を承認
ko: 변경 승인
pt: Aprovar alteração
ru: Подтвердить изменение
zh_hans: 批准更改
zh_hant: 核准變更

# recover
source: Recover with YNX Wallet
ar: الاسترداد باستخدام YNX Wallet
de: Mit YNX Wallet wiederherstellen
es: Recuperar con YNX Wallet
fr: Récupérer avec YNX Wallet
id: Pulihkan dengan YNX Wallet
ja: YNX Walletで復旧
ko: YNX Wallet으로 복구
pt: Recuperar com YNX Wallet
ru: Восстановить через YNX Wallet
zh_hans: 使用 YNX 钱包恢复
zh_hant: 使用 YNX Wallet 復原

# privacy
source: Only selected event details are sent to AI after approval.
ar: لا تُرسل إلى الذكاء الاصطناعي إلا تفاصيل الأحداث المحددة وبعد الموافقة.
de: Nur ausgewählte Termindetails werden nach Freigabe an die KI gesendet.
es: Solo los detalles seleccionados se envían a la IA tras la aprobación.
fr: Seuls les détails sélectionnés sont envoyés à l’IA après approbation.
id: Hanya detail acara yang dipilih yang dikirim ke AI setelah persetujuan.
ja: 承認後、選択した予定の詳細だけをAIに送信します。
ko: 승인 후 선택한 일정 정보만 AI로 전송됩니다.
pt: Somente detalhes selecionados são enviados à IA após aprovação.
ru: Только выбранные сведения отправляются ИИ после подтверждения.
zh_hans: 只有批准后才会把选中的日程详情发送给 AI。
zh_hant: 只有核准後才會將所選活動詳情傳送給 AI。

# ai
source: Scheduling assistant
ar: مساعد الجدولة
de: Terminassistent
es: Asistente de horarios
fr: Assistant de planification
id: Asisten penjadwalan
ja: スケジュールアシスタント
ko: 일정 도우미
pt: Assistente de agenda
ru: Помощник расписания
zh_hans: 排程助手
zh_hant: 排程助理

# ai_language
source: AI output language
ar: لغة مخرجات الذكاء الاصطناعي
de: KI-Ausgabesprache
es: Idioma de salida de IA
fr: Langue de sortie de l’IA
id: Bahasa keluaran AI
ja: AI出力言語
ko: AI 출력 언어
pt: Idioma de saída da IA
ru: Язык ответа ИИ
zh_hans: AI 输出语言
zh_hant: AI 輸出語言

# unavailable
source: Gateway unavailable
ar: البوابة غير متاحة
de: Gateway nicht verfügbar
es: Gateway no disponible
fr: Passerelle indisponible
id: Gateway tidak tersedia
ja: ゲートウェイを利用できません
ko: 게이트웨이를 사용할 수 없음
pt: Gateway indisponível
ru: Шлюз недоступен
zh_hans: 网关不可用
zh_hant: 閘道無法使用

# security
source: Wallet approval never shares recovery material.
ar: موافقة المحفظة لا تشارك مواد الاسترداد مطلقًا.
de: Die Wallet-Freigabe gibt niemals Wiederherstellungsmaterial weiter.
es: La aprobación de Wallet nunca comparte material de recuperación.
fr: L’approbation Wallet ne partage jamais les données de récupération.
id: Persetujuan Wallet tidak pernah membagikan materi pemulihan.
ja: Walletの承認で復旧情報が共有されることはありません。
ko: Wallet 승인은 복구 자료를 공유하지 않습니다.
pt: A aprovação da Wallet nunca compartilha material de recuperação.
ru: Подтверждение Wallet никогда не раскрывает данные восстановления.
zh_hans: 钱包批准绝不会共享恢复材料。
zh_hant: 錢包核准絕不會分享復原資料。

# a11y_timeline
source: Calendar timeline
ar: المخطط الزمني للتقويم
de: Kalender-Zeitachse
es: Cronología del calendario
fr: Chronologie du calendrier
id: Linimasa kalender
ja: カレンダータイムライン
ko: 캘린더 타임라인
pt: Linha do tempo do calendário
ru: Лента календаря
zh_hans: 日历时间线
zh_hant: 行事曆時間軸

source: RSVP
ar: الرد على الدعوة
de: Auf Einladung antworten
es: Responder invitación
fr: Répondre à l’invitation
id: Tanggapi undangan
ja: 出欠を回答
ko: 참석 여부 응답
pt: Responder ao convite
ru: Ответить на приглашение
zh_hans: 回复邀请
zh_hant: 回覆邀請

# update
source: Update event
ar: تحديث الحدث
de: Termin aktualisieren
es: Actualizar evento
fr: Modifier l’événement
id: Perbarui acara
ja: 予定を更新
ko: 일정 업데이트
pt: Atualizar evento
ru: Обновить событие
zh_hans: 更新日程
zh_hant: 更新活動

source: Cancel event
ar: إلغاء الاجتماع
de: Besprechung absagen
es: Cancelar reunión
fr: Annuler la réunion
id: Batalkan rapat
ja: 会議をキャンセル
ko: 회의 취소
pt: Cancelar reunião
ru: Отменить встречу
zh_hans: 取消会议
zh_hant: 取消會議

# share
source: Share calendar
ar: مشاركة التقويم
de: Kalender teilen
es: Compartir calendario
fr: Partager le calendrier
id: Bagikan kalender
ja: カレンダーを共有
ko: 캘린더 공유
pt: Compartilhar calendário
ru: Поделиться календарём
zh_hans: 共享日历
zh_hant: 分享行事曆

source: Meeting link
ar: رابط الاجتماع
de: Besprechungslink
es: Enlace de reunión
fr: Lien de réunion
id: Tautan rapat
ja: 会議リンク
ko: 회의 링크
pt: Link da reunião
ru: Ссылка на встречу
zh_hans: 会议链接
zh_hant: 會議連結
